In [2]:
import pandas as pd

In [3]:
df_exams=pd.read_csv("StudentsPerformance.csv")

In [4]:
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Operaciones matemáticas Maths operacions

# 1.1 operaciones en columnas

In [10]:
# + primero anoto la tabla y despues la comuna y despues sumar
df_exams["math score"].sum()

66089

In [11]:
# count, mean, std, max and min. mean es media o promedio
df_exams["math score"].mean()

66.089

In [12]:
df_exams["math score"].count()

1000

In [13]:
df_exams["math score"].std()

15.163080096009468

In [14]:
df_exams["math score"].max()

100

In [15]:
df_exams["math score"].min()

0

In [17]:
# CASI MISMO RESULTADO  con .describe() que te da COUNT, MEAN, STD, MIN, MAX 25, 50 Y 75%
df_exams["math score"].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

# 1.2 Operaciones en las filas

In [7]:
# para calcular la suma de una fila de diferentes columnas
df_exams["math score"], df_exams["reading score"], df_exams["writing score"]

(0      72
 1      69
 2      90
 3      47
 4      76
        ..
 995    88
 996    62
 997    59
 998    68
 999    77
 Name: math score, Length: 1000, dtype: int64,
 0      72
 1      90
 2      95
 3      57
 4      78
        ..
 995    99
 996    55
 997    71
 998    78
 999    86
 Name: reading score, Length: 1000, dtype: int64,
 0      74
 1      88
 2      93
 3      44
 4      75
        ..
 995    95
 996    55
 997    65
 998    77
 999    86
 Name: writing score, Length: 1000, dtype: int64)

In [8]:
df_exams["math score"] + df_exams["reading score"] + df_exams["writing score"]

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [12]:
#para calcular la nota promedio (para eso sumo y divido en 3)y asignar el resultado a una nueva columna
#creo una nueva columna con la formaula, al escribir el nomnre de la dataframe y entre corchetes y comillas en nuevo nombre 
#de la nueva columna
df_exams["average chanchi"] = df_exams["math score"] + df_exams["reading score"] + df_exams["writing score"]/3

In [13]:
#mostrar la dataframe
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average,average chanchi
0,female,group B,bachelor's degree,standard,none,72,72,74,168.666667,168.666667
1,female,group C,some college,standard,completed,69,90,88,188.333333,188.333333
2,female,group B,master's degree,standard,none,90,95,93,216.000000,216.000000
3,male,group A,associate's degree,free/reduced,none,47,57,44,118.666667,118.666667
4,male,group C,some college,standard,none,76,78,75,179.000000,179.000000
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,218.666667,218.666667
996,male,group C,high school,free/reduced,none,62,55,55,135.333333,135.333333
997,female,group C,high school,free/reduced,completed,59,71,65,151.666667,151.666667
998,female,group D,some college,standard,completed,68,78,77,171.666667,171.666667
999,female,group D,some college,free/reduced,none,77,86,86,191.666667,191.666667

In [14]:
#muestro otra vez la tabla pero con promedio de solo dos numeros decimales, con la funcion round
df_exams.round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average,average chanchi
0,female,group B,bachelor's degree,standard,none,72,72,74,168.67,168.67
1,female,group C,some college,standard,completed,69,90,88,188.33,188.33
2,female,group B,master's degree,standard,none,90,95,93,216.00,216.00
3,male,group A,associate's degree,free/reduced,none,47,57,44,118.67,118.67
4,male,group C,some college,standard,none,76,78,75,179.00,179.00
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,218.67,218.67
996,male,group C,high school,free/reduced,none,62,55,55,135.33,135.33
997,female,group C,high school,free/reduced,completed,59,71,65,151.67,151.67
998,female,group D,some college,standard,completed,68,78,77,171.67,171.67
999,female,group D,some college,free/reduced,none,77,86,86,191.67,191.67